homeworkHOWTO.org
#+TITLE:   HOWTO Submit Assignments for STAT 5840
#+AUTHOR:    G. Jay Kerns
#+EMAIL:     gkerns@ysu.edu
#+DATE:      STAT 5840: Summer 2017
#+LANGUAGE:  en
#+OPTIONS:   H:4 toc:nil author:nil ^:nil num:nil
#+BABEL: :session *R* :results output pp :tangle yes
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [10pt,english]
#+LATEX_HEADER: \input{handouts/handoutformat}
#+latex: \thispagestyle{empty}

* Who
You.

* What
All STAT 5840 assignments to be turned in for a grade should be
submitted as =R Markdown= files, that is, a text file with file extension
=.Rmd= which contains =R= code mixed with \(\LaTeX\) code to
ultimately come together to comprise a self-contained statistical
report. Your file should be named according to the following scheme:

: LastNameDueDate.Rmd

So, for example, if I were going to submit an assignment due on July
27, I would submit a file called =Kerns072717.Rmd=.

* When
Assignments are due /before class/ on the due-date assigned.  If it
isn't in my email INBOX by 10:00am, then it's late, period.  Early
submissions (to protect against the occasional email snafu) are
welcomed and encouraged (for the final exam assignment, in
particular).

* Where
Send STAT 5840 submissions to my YSU email address, =gkerns@ysu.edu=.
Attach your =.Rmd= file to the email.  The subject line of the email
should read =STAT 5840 LastName DueDate=.  So, for instance, if I were
turning in an assignment due on July 27 my email subject would read
=STAT 5840 Kerns 072717=.

* How
Use the templates I provide plus the =R= scripts we discuss in class
to help you write your report(s).  In every case the work you need to
do is scantly more than copy-pasting the work I've done and tweaking
it a little bit for your particular assignment.  Don't reinvent the
wheel; it's rolling right there in front of you.  If you have a
personal computer at home and can manage to get it up and running to
meet all of the installation requirements, then I encourage you to
work at home.  Everything's *free*, after all.  Nevertheless, if you
/don't/ own a personal computer or can't manage to get everything
running, then you can always use the Computer Lab in Lincoln 403.  I
have checked it out and confirmed that everything there works without
any trouble.

* Why
- Short answer: :: you'd like to pass the class.  
- Long answer: :: you have a burning, aching desire in the deepest
                  reachest of your fiery intellect to become the
                  baddest-assed computational statistician this side
                  of the Mississippi River, and submission of a data
                  analysis assignment for STAT 5840 Summer 2017 is, in
                  your view, one of the preliminary first steps in a
                  long series of incremental successes toward that
                  ultimate goal of superlative awesome-ness.
