homeworkHOWTO.tex
% Created 2017-06-26 Mon 08:19
% Indented LaTeX compiler: pdflatex
\documentclass[10pt,english]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{handouts/handoutformat}
\date{STAT 5840: Summer 2017}
\title{HOWTO Submit Assignments for STAT 5840}
\hypersetup{
 pdfauthor={G. Jay Kerns},
 pdftitle={HOWTO Submit Assignments for STAT 5840},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\thispagestyle{empty}

\section*{Who}
\label{sec:orgheadline1}
You.

\section*{What}
\label{sec:orgheadline2}
All STAT 5840 assignments to be turned in for a grade should be
submitted as \texttt{R Markdown} files, that is, a text file with file extension
\texttt{.Rmd} which contains \texttt{R} code mixed with \LaTeX{} code to
ultimately come together to comprise a self-contained statistical
report. Your file should be named according to the following scheme:

\begin{verbatim}
LastNameDueDate.Rmd
\end{verbatim}

So, for example, if I were going to submit an assignment due on July
27, I would submit a file called \texttt{Kerns072717.Rmd}.

\section*{When}
\label{sec:orgheadline3}
Assignments are due \emph{before class} on the due-date assigned.  If it
isn't in my email INBOX by 10:00am, then it's late, period.  Early
submissions (to protect against the occasional email snafu) are
welcomed and encouraged (for the final exam assignment, in
particular).

\section*{Where}
\label{sec:orgheadline4}
Send STAT 5840 submissions to my YSU email address, \texttt{gkerns@ysu.edu}.
Attach your \texttt{.Rmd} file to the email.  The subject line of the email
should read \texttt{STAT 5840 LastName DueDate}.  So, for instance, if I were
turning in an assignment due on July 27 my email subject would read
\texttt{STAT 5840 Kerns 072717}.

\section*{How}
\label{sec:orgheadline5}
Use the templates I provide plus the \texttt{R} scripts we discuss in class
to help you write your report(s).  In every case the work you need to
do is scantly more than copy-pasting the work I've done and tweaking
it a little bit for your particular assignment.  Don't reinvent the
wheel; it's rolling right there in front of you.  If you have a
personal computer at home and can manage to get it up and running to
meet all of the installation requirements, then I encourage you to
work at home.  Everything's \textbf{free}, after all.  Nevertheless, if you
\emph{don't} own a personal computer or can't manage to get everything
running, then you can always use the Computer Lab in Lincoln 403.  I
have checked it out and confirmed that everything there works without
any trouble.

\section*{Why}
\label{sec:orgheadline6}
\begin{description}
\item[{Short answer:}] you'd like to pass the class.
\item[{Long answer:}] you have a burning, aching desire in the deepest
reachest of your fiery intellect to become the
baddest-assed computational statistician this side
of the Mississippi River, and submission of a data
analysis assignment for STAT 5840 Summer 2017 is, in
your view, one of the preliminary first steps in a
long series of incremental successes toward that
ultimate goal of superlative awesome-ness.
\end{description}
\end{document}